[
    {
        "page": 1,
        "chunk_id": 1,
        "text": "Para informações sobre nossa grande variedade de produtos de madeira, entre em contato pelo telefone (62)3282-7788 ou visite nosso site @madeireira woodfort."
    },
    {
        "page": 2,
        "chunk_id": 2,
        "text": "SOBRE Somos uma empresa especializada em produtos de madeira em geral, desde tábuas, vigas até portas, janelas, decks e forros. Há 30 anos no mercado adquirimos vasta experiência sendo uma das maiores madeireiras do estado de Goiás tendo um imenso estoque das mais variadas espécies de madeira, todas devidamente legalizadas e documentadas pelo Ibama. LOCALIZAÇÃO ALAMEDA CONTORNO, Nº. 1894, CEP 74853-120, JARDIM SANTO ANTÔNIO, GOIÂNIA, GOIÁS (62)3282-7788 SEG - SEXTA: 08:00 - 18:00 SÁBADO: 08:00 - 12:00"
    },
    {
        "page": 2,
        "chunk_id": 3,
        "text": "SÁBADO: 08:00 - 12:00."
    },
    {
        "page": 3,
        "chunk_id": 4,
        "text": "ÍNDICE Forro 1, Ripado 5, Decks 8, Madeirite/Compensado 11, Janela 14, Porta 22, Fechadura 30, Puxador 63, Proteção e acabamento 68."
    },
    {
        "page": 4,
        "chunk_id": 5,
        "text": "M A D E I R E I R A WOOD FORT NOSSO FORTE É MADEIRA. Catálogo de Forro."
    },
    {
        "page": 5,
        "chunk_id": 6,
        "text": "IPÊ Vendido por pacote de 14 peças, 10 cm de largura, de 2,00m a 6,00m de comprimento, 1 cm de espessura, encaixe macho-fêmea. CUMARÚ Vendido por pacote de 14 e 15 peças, 10 cm de largura, de 1,00m a 6,00m de comprimento, 1 cm de espessura, encaixe macho-fêmea. TAUARI CHAMPAGNE (TINGIDO) Vendido por pacote de 14 peças, 10 cm de largura, de 2,00m a 6,00m de comprimento, 1 cm de espessura, encaixe macho-fêmea. LEGENDA: Durabilidade e Resistência, Preço, Acabamento e Beleza."
    },
    {
        "page": 6,
        "chunk_id": 7,
        "text": "TAUARI CHAMPAGNE Vendido por pacote de 14 peças 10 cm de largura 2,00m a 6,00m de comprimento 1 cm de espessura Encaixe \"macho-fêmea\" CEDRINHO MESCLADO (NATURAL) Vendido por pacote de 13 e 14 peças 9,5 cm de largura 2,00m a 6,00m de comprimento 1 cm de espessura Encaixe \"macho-fêmea\" CEDRINHO EXPORTAÇÃO Vendido por pacote de 13 e 14 peças 9,5 cm de largura 2,00m a 6,00m de comprimento 1 cm de espessura Encaixe \"macho-fêmea\". Cerne da madeira (melhor qualidade) quando comparado ao mesclado."
    },
    {
        "page": 6,
        "chunk_id": 8,
        "text": "LEGENDA: Durabilidade e Resistência, Preço, Acabamento e Beleza."
    },
    {
        "page": 7,
        "chunk_id": 9,
        "text": "4 PÍNUS (FORRO PAULISTA) Vendido por pacote de 17 peças 12,5 cm de largura 2,50m a 4,00m de comprimento 1 cm de espessura Encaixe \"macho-fêmea\". CEDRINHO MESCLADO (TINGIDO) Vendido por pacote de 13 e 14 peças 9,5 cm de largura 2,00m a 6,00m de comprimento 1 cm de espessura Encaixe \"macho-fêmea\"."
    },
    {
        "page": 8,
        "chunk_id": 10,
        "text": "MADEIREIRA WOOD FORT - NOSSO FORTE É MADEIRA. Ripado Catálogo."
    },
    {
        "page": 9,
        "chunk_id": 11,
        "text": "CUMARÚ 2CM X 2CM Feito sob encomenda Medidas: Largura total: 5,5 cm, Largura útil: 4,0 cm, Encaixe macho-fêmea. MASSARANDUBA 2CM X 2CM Feito sob encomenda Medidas: Largura total: 5,5 cm, Largura útil: 4,0 cm, Encaixe macho-fêmea. LEGENDA: Durabilidade e Resistência, Preço, Acabamento e Beleza."
    },
    {
        "page": 10,
        "chunk_id": 12,
        "text": "SUCUPIRA 2CM X 2CM Feito sob encomenda Medidas: Largura total: 5,5 cm, Largura útil: 4,0 cm, Encaixe tipo 'macho-fêmea'. TAUARI 2CM X 2CM Feito sob encomenda Medidas: Largura total: 5,5 cm, Largura útil: 4,0 cm, Encaixe tipo 'macho-fêmea'. Obs: Recomendado somente para área interna. LEGENDA: Durabilidade e Resistência, Preço, Acabamento e Beleza."
    },
    {
        "page": 11,
        "chunk_id": 13,
        "text": "M A D E I R E I R A WOOD FORT NOSSO FORTE É MADEIRA Decks C a t á l o g o"
    },
    {
        "page": 12,
        "chunk_id": 14,
        "text": "IPÊ: Madeira mais resistente e durável do mercado, adequada para ambiente interno e externo, pois resiste a água. Possui 1 cm de espessura e 9,5 cm de largura. Fabricamos sob medida.\nCUMARU: Madeira resistente, conhecida pela sua beleza e versatilidade, possui tonalidade bastante semelhante ao ipê. Adequada para ambiente interno e externo, pois resiste a água. Possui 1 cm de espessura e 9,5 cm de largura. Fabricamos sob medida.\nPINUS TRATADO: Madeira com excelente custo benefício, recomendada para ambiente interno. Possui 1 cm de espessura, 9,5 cm de largura e peças com 3 metros de comprimento."
    },
    {
        "page": 13,
        "chunk_id": 15,
        "text": "10 MASSARANDUBA Madeira nobre de resistência e durabilidade semelhante ao ipê. Ambiente interno e externo (resiste a água). 1 cm de espessura, 9,5cm de largura. Fabricamos sob medida. SUCUPIRA Madeira nobre caracterizada por sua tonalidade escura. Ambiente interno e externo (resiste a água). 1 cm de espessura, 9,5cm de largura. Fabricamos sob medida. TAUARI Madeira de lei com excelente custo benefício, recomendada para ser instalada somente em ambientes internos. 1 cm de espessura, 9,5cm de largura. Fabricamos sob medida."
    },
    {
        "page": 13,
        "chunk_id": 16,
        "text": "MASSARANDUBA Madeira nobre de resistência e durabilidade semelhante ao ipê. Ambiente interno e externo (resiste a água). 1 cm de espessura, 9,5 cm de largura. Fabricamos sob medida. SUCUPIRA Madeira nobre caracterizada por sua tonalidade escura. Ambiente interno e externo (resiste a água). 1 cm de espessura, 9,5 cm de largura. Fabricamos sob medida. TAUARI Madeira de lei com excelente custo-benefício, recomendada para ser instalada somente em ambientes internos. 1 cm de espessura, 9,5 cm de largura. Fabricamos sob medida. LEGENDA Durabilidade e Resistência, Preço, Acabamento e Beleza."
    },
    {
        "page": 14,
        "chunk_id": 17,
        "text": "11 M A D E I R E I R A WOOD FORT NOSSO FORTE É MADEIRA Compensado Madeirite Catálogo"
    },
    {
        "page": 15,
        "chunk_id": 18,
        "text": "PLASTIFICADO Dimensões: 2,20m x 1,10m, Espessura: 10mm, Utilidades: Fôrma para concreto, Resistente a água, Possui camada lisa de filme preto, Mezanino. Dimensões: 2,44m x 1,22m, Espessura: 20mm, Utilidades: Assoalhos, Bem resistente. OSB Dimensões: 2,20m x 1,22m, Espessura: 8mm a 14mm, Utilidades: Tapume, Uso decorativo, Paredes, Pode ser usada para móveis, Decoração. RESINADO Dimensões: 2,20m x 5m, Espessura: 5mm, Utilidades: Fôrma para concreto, Resistente a água."
    },
    {
        "page": 15,
        "chunk_id": 19,
        "text": "PLASTIFICADO Dimensões: 2,20m x 1,10m, Espessura: 10mm, Utilidades: Fôrma para concreto, Possui camada lisa e filme preto de 20mm. Mezanino, Assoalhos. Bem resistente. OSB Dimensões: 2,20m x 1,22m, Espessura: 8mm a 14mm, Utilidades: Tapume, Uso decorativo, Paredes, Decoração, Pode ser usada para móveis. RESINADO Dimensões: 2,20m x 5m, Espessura: 5mm, Utilidades: Fôrma para concreto, Resistente a água. Material frágil."
    },
    {
        "page": 16,
        "chunk_id": 20,
        "text": "NAVAL Dimensões Espessura Utilidades Sobre  Fôrma para concreto resistente à água em 10mm a Forma para 2,20m x 5mm média 3 a 4, e 2,20m x 1,10m 1720mm. Material de filme preto, bem resistente, PARICÁ Dimensões Espessura Utilidades Sobre Moldura para Revestimento de fácil manuseio 2,20m x 45mm a concreto."
    },
    {
        "page": 16,
        "chunk_id": 21,
        "text": "manuseio 2,20m x 1,10m x 1,60m, o manuseio do filme de filme preto é fácil e possui uma tonalidade clara, sendo bem resistente."
    },
    {
        "page": 17,
        "chunk_id": 22,
        "text": "14 MADEIREIRA WOOD FORT NOSSO FORTE É MADEIRA JANELAS Catálogo"
    },
    {
        "page": 18,
        "chunk_id": 23,
        "text": "Maçiça Largura (cm): Definida pelo cliente, Altura: Definida pelo cliente."
    },
    {
        "page": 19,
        "chunk_id": 24,
        "text": "MMMaaaccciiiçççaaa Largura (cm) Definida pelo cliente Altura Definida pelo cliente"
    },
    {
        "page": 20,
        "chunk_id": 25,
        "text": "MMMaaaccciiiçççaaa: Largura (cm) Definida pelo cliente. Altura Definida pelo cliente."
    },
    {
        "page": 21,
        "chunk_id": 26,
        "text": "MMMaaaccciiiçççaaa Largura (cm) Definida pelo cliente Altura Definida pelo cliente."
    },
    {
        "page": 22,
        "chunk_id": 27,
        "text": "19 13 14 Maciça Largura (cm) Definida pelo cliente Altura Definida pelo cliente 15"
    },
    {
        "page": 23,
        "chunk_id": 28,
        "text": "MMMaaaccciiiçççaaa Largura (cm) Definida pelo cliente Altura Definida pelo cliente"
    },
    {
        "page": 24,
        "chunk_id": 29,
        "text": "21 19 20 Mácia Largura (cm) Definida pelo cliente Altura Definida pelo cliente"
    },
    {
        "page": 25,
        "chunk_id": 30,
        "text": "MADEIREIRA WOOD FORT - NOSSO FORTE É MADEIRA. Catálogo de portas."
    },
    {
        "page": 26,
        "chunk_id": 31,
        "text": "Solid, Semi-Solid doors in Angelim, Tauari, Ipê, Curupixá. Available sizes: Width (cm): 60, 70, 80, 90, 100, 110 or up to 164, Height: 2.10m to 2.75m."
    },
    {
        "page": 27,
        "chunk_id": 32,
        "text": "24 Sólida Porta ripada Angelim Tauari Ipê Curupixá Sólida Largura (cm) 60, 70, 80, 90, 100, 110 ou até 164. Altura até 2,75m"
    },
    {
        "page": 28,
        "chunk_id": 33,
        "text": "SSSóóóllliiidddaaa Porta imbuia/ébano (com metal e sem metal) Largura Somente 1,20m Alturas disponíveis: 2,10m, 2,40m."
    },
    {
        "page": 29,
        "chunk_id": 34,
        "text": "SSSóóóllliiidddaaa Porta imbuia escura/ipê (sem metal) Largura Somente 1,20m Altura 2,10m"
    },
    {
        "page": 30,
        "chunk_id": 35,
        "text": "Porta imbuia escura/ipê (sem metal), com largura de 1,20m e altura de 2,10m. As maçanetas têm largura e altura definidas pelo cliente."
    },
    {
        "page": 31,
        "chunk_id": 36,
        "text": "28 MMMaaaccciiiçççaaa Largura (cm) Definida pelo cliente Altura Definida pelo cliente"
    },
    {
        "page": 32,
        "chunk_id": 37,
        "text": "MMMaaaccciiiçççaaa Veneziana/Vidro. Largura (cm) e altura definidas pelo cliente."
    },
    {
        "page": 33,
        "chunk_id": 38,
        "text": "MADEIREIRA WOOD FORT - NOSSO FORTE É MADEIRA. Catálogo de Fechaduras."
    },
    {
        "page": 34,
        "chunk_id": 39,
        "text": "EXPRESSÃO Digital @ MADEIREIRA WOOD FORT: Autonomia de 4 pilhas AA - 1 ano, 8 pilhas AA - 2 anos. Função 'não perturbe', Trava de bloqueio digital manual até 40 digitais, LINHA PREMIUM."
    },
    {
        "page": 35,
        "chunk_id": 40,
        "text": "Roseta Cromada, Material Zamac, Máquina 40mm, Aço, Maçaneta Inoxidável, LINHA PREMIUM EXTERNA BANHEIRO."
    },
    {
        "page": 36,
        "chunk_id": 41,
        "text": "Roseta Cromada Material Zamac Máquina 40mm Aço Maçaneta Inoxidável @ MADEIREIRA WOODFORT LINHA PREMIUM EXTERNA BANHEIRO"
    },
    {
        "page": 37,
        "chunk_id": 42,
        "text": "IBIZA Roseta Cromada, Material Zamac, Máquina 55mm, Maçaneta Zamac, Linha Premium, MADEIREIRA WOODFORT, Uso Externo Banheiro."
    },
    {
        "page": 38,
        "chunk_id": 43,
        "text": "KARLI Roseta Cromada Material Zamac Máquina 55mm Maçaneta Zamac @ MADEIREIRA WOODFORT LINHA PREMIUM EXTERNA BANHEIRO"
    },
    {
        "page": 39,
        "chunk_id": 44,
        "text": "MADRID Roseta Cromada, Material Zamac, Máquina 40mm, Maçaneta de Aço Inoxidável, Linha Premium, para uso externo em banheiros, disponível na Madeireira Woodfort."
    },
    {
        "page": 40,
        "chunk_id": 45,
        "text": "37 CONCEPT 403 Espelho Maçaneta Cromada, Material: Zamac, Máquina: 40mm, Aço Inoxidável. Linha Premium para Banheiro Externo. Madeireira Woodfort."
    },
    {
        "page": 41,
        "chunk_id": 46,
        "text": "PORTA DE CORRER Concha Cromada Material Zamac Máquina 30mm Aço Concha Inoxidável @ MADEIREIRA WOODFORT LINHA PREMIUM BICO-DE-PAPAGAIO"
    },
    {
        "page": 42,
        "chunk_id": 47,
        "text": "ROLETE Concha Cromada Material Zamac Máquina 30mm Aço Concha Inoxidável @ MADEIREIRA WOODFORT LINHA PREMIUM"
    },
    {
        "page": 43,
        "chunk_id": 48,
        "text": "DESIGN Roseta Cromada, Material: Aço inoxidável, Máquina: 40mm, Aço Maçaneta inoxidável. @ MADEIREIRA WOODFORT LINHA BÁSICA EXTERNA"
    },
    {
        "page": 44,
        "chunk_id": 49,
        "text": "Roseta Cromada, material inoxidável, maçaneta de aço 40mm, design para uso externo e banheiro, da LINHA CLÁSSICA @ MADEIREIRA WOODFORT."
    },
    {
        "page": 45,
        "chunk_id": 50,
        "text": "ATENAS Roseta Latão Oxidado Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT EXTERNA E BANHEIRO LINHA CLÁSSICA"
    },
    {
        "page": 46,
        "chunk_id": 51,
        "text": "ATENAS Roseta Cromada, material de aço inoxidável, com máquina de 40mm e maçaneta de aço inoxidável. Produto disponível na MADEIREIRA WOODFORT, linha clássica, adequado para uso externo e em banheiros."
    },
    {
        "page": 47,
        "chunk_id": 52,
        "text": "ATENAS Roseta Grafite Aço Material inoxidável, Máquina 40mm, Aço Maçaneta inoxidável para uso EXTERNO E BANHEIRO, da MADEIREIRA WOODFORT, LINHA CLÁSSICA."
    },
    {
        "page": 48,
        "chunk_id": 53,
        "text": "2007/04 ATENAS Roseta Cromada Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT LINHA CLÁSSICA EXTERNA E BANHEIRO"
    },
    {
        "page": 49,
        "chunk_id": 54,
        "text": "2007/12 ATENAS Roseta Cromada Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT LINHA CLÁSSICA EXTERNA E BANHEIRO"
    },
    {
        "page": 50,
        "chunk_id": 55,
        "text": "2004/7 VENEZA Espelho Cromado Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável. Linha Clássica. Madeireira Wood Externa e Banheiro."
    },
    {
        "page": 51,
        "chunk_id": 56,
        "text": "1913 Espelho Preto Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOOD EXTERNA FORT LINHA CLÁSSICA"
    },
    {
        "page": 52,
        "chunk_id": 57,
        "text": "Espelho Inox Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável, MADEIREIRA WOOD, EXTERNA, LINHA CLÁSSICA."
    },
    {
        "page": 53,
        "chunk_id": 58,
        "text": "1913 Espelho Dourado em Aço Inoxidável com Maçaneta de 40mm @ MADEIREIRA WOODFORT, para Banheiro, Linha Clássica."
    },
    {
        "page": 54,
        "chunk_id": 59,
        "text": "Espelho Cromada Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT BANHEIRO LINHA CLÁSSICA"
    },
    {
        "page": 55,
        "chunk_id": 60,
        "text": "Espelho de aço inoxidável com acabamento em titânio, maçaneta de 40mm em aço inoxidável, da linha clássica de banheiro da MADEIREIRA WOODFORT."
    },
    {
        "page": 56,
        "chunk_id": 61,
        "text": "54 243 GOLF Espelho Dourada Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável."
    },
    {
        "page": 57,
        "chunk_id": 62,
        "text": "DALI Espelho Dourada, Material: Aço inoxidável, Máquina: 40mm, Maçaneta: Aço inoxidável. Linha clássica MADEIREIRA WOODFORT para banheiro."
    },
    {
        "page": 58,
        "chunk_id": 63,
        "text": "VERONA Espelho L. Oxidado, fabricado com material de aço inoxidável, possui maçaneta também de aço inoxidável, tamanho de 40mm. Disponível na MADEIREIRA WOODFORT, linha clássica para banheiro."
    },
    {
        "page": 59,
        "chunk_id": 64,
        "text": "PLUS 2106 Espelho Inox Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT LINHA CLÁSSICA INTERNA"
    },
    {
        "page": 60,
        "chunk_id": 65,
        "text": "58 2106 GENOVA Espelho Oxidado. Material: Aço inoxidável. Máquina 40mm, Aço. Maçaneta inoxidável. Madeireira Woodfort Linha Clássica Interna."
    },
    {
        "page": 61,
        "chunk_id": 66,
        "text": "1973/2 Espelho Fumê, Aço Material inoxidável, Máquina 40mm, Aço Maçaneta inoxidável, Madeireira Woodfort, Linha Clássica Externa."
    },
    {
        "page": 62,
        "chunk_id": 67,
        "text": "1979 Espelho Cromado Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT BANHEIRO LINHA CLÁSSICA"
    },
    {
        "page": 63,
        "chunk_id": 68,
        "text": "2007/11 Espelho L. Oxidado Aço Material inoxidável Máquina 40mm Aço Maçaneta inoxidável @ MADEIREIRA WOODFORT BANHEIRO LINHA CLÁSSICA"
    },
    {
        "page": 64,
        "chunk_id": 69,
        "text": "2007/11 Espelho Cromada, Material Aço inoxidável, Máquina 40mm, Maçaneta Aço inoxidável, BANHEIRO LINHA CLÁSSICA @ MADEIREIRA WOOD FORT."
    },
    {
        "page": 65,
        "chunk_id": 70,
        "text": "M A D E I R E I R A WOOD FORT NOSSO FORTE É MADEIRA"
    },
    {
        "page": 66,
        "chunk_id": 71,
        "text": "Tamanho (cm) 13x40, 20x60, 40x40."
    },
    {
        "page": 67,
        "chunk_id": 72,
        "text": "Tamanho (cm): 25x80, 80x30"
    },
    {
        "page": 68,
        "chunk_id": 73,
        "text": "Tamanho (cm) 25, 80, 80, 30, 80, 60, 60, 80, 100, 122, 50, 100, 80"
    },
    {
        "page": 69,
        "chunk_id": 74,
        "text": "Tamanho (cm) 80 60. Altura (mt) Sob medida."
    },
    {
        "page": 70,
        "chunk_id": 75,
        "text": "MADEIREIRA WOOD FORT - NOSSO FORTE É MADEIRA. Proteção e acabamento. Catálogo."
    },
    {
        "page": 71,
        "chunk_id": 76,
        "text": "69 SELADORA FUNDO E ACABAMENTO Entre demão: 1 hora. Final: 24 horas. Acabamento fosco. Utilizada para selar e reduzir a porosidade de madeiras em geral. Para uso interno. Aplicação em madeira. Tamanhos disponíveis: 3,6 L, 0,9 L, 18 L. SELADORA CONCENTRADA Entre demão: 1 hora. Final: 24 horas. Acabamento fosco, para selar e reduzir a porosidade de móveis de madeira em geral. Para uso interno. Aplicação em madeira. Tamanhos disponíveis: 3,6 L, 0,9 L. SPARLACK SELADORA CONCENTRADA Entre demãos: 2 horas. Rendimento: até 45 m²/Galão/demão, até 11 m²/¼ Galão/demão."
    },
    {
        "page": 71,
        "chunk_id": 77,
        "text": "Para lixamento: Mínimo 2 horas."
    },
    {
        "page": 72,
        "chunk_id": 78,
        "text": "SELADORA SAYERLACK CONCENTRADA: Entre demãos: 1 hora. Tempo de secagem final: 24 horas. Acabamento sedoso. Rendimento com pistola: 20 m² por galão por demão. Quantidades disponíveis: 3,6 L e 0,9 L. VERNIZ POLIULACK FOSCO ACETINADO: Entre as demãos: 12 horas. Tempo de secagem completo: 24 horas. Rendimento mínimo por 3,6 L: 20 m² acabados, e por 0,9 L: 5 m² acabados. Quantidades disponíveis: 3,6 L e 0,9 L. VERNIZ MARÍTIMO FOSCO: Aplicação em madeira nova: 3 demãos. Repintura: 1 ou 2 demãos. Entre demãos: 8 a 12 horas. Rendimento acabado: até 17 m² por galão e até 4 m² por ¼ galão. Quantidades disponíveis: 3,6 L e 0,9 L."
    },
    {
        "page": 73,
        "chunk_id": 79,
        "text": "VERNIZ POLIULACK BRILHANTE Entre as demãos: 12 horas. Completa: 24 horas. Mínimo 22 m2 / 3,6L / Acabado. QUANT. Mínimo 5,5 m2 / 900 mL / Acabado. 3,6 L 0,9 L SAYERLACK VERNIZ POLIREX Entre demãos: 12 horas. Mínimo 20 m2 / 3,6L / Acabado. Mínimo 5 m2 / 900mL / Acabado. QUANT. Durabilidade de até 3 anos. 3,6 L 0,9 L TINGIDOR Frasco 150 ml. Frasco 900 ml. 150ml: Direto na madeira: Mín. 2,7m² (ou mín. 18m²/litro) 900ml: Direto na madeira: Mín. 16,2m² (ou mín. 18m²/litro) QUANT. Secagem: Final - 1 hora 500 ML 150 ML"
    },
    {
        "page": 73,
        "chunk_id": 80,
        "text": "Secagem: Final - 1 hora. Disponível em embalagens de 500 ML e 150 ML."
    },
    {
        "page": 74,
        "chunk_id": 81,
        "text": "72 STAIN POLISTEN NATURAL Entre as demãos: 6 a 8 horas. Tempo de secagem completa: 24 horas. Empilhamento: 24 horas. Quantidade: Rendimento é de 68 m² por galão por demão. Disponível em quantidades de 3,6 L e 0,9 L. \n\nSPARLACK CETOL DECK Hidropelente. Aplicação em madeira nova requer 3 demãos, enquanto repintura necessita de 1 ou 2 demãos. Rendimento até 16 m² por galão, até 4 m² por ¼ galão. Embalagens de 3,6 L e 0,9 L. \n\nOSMOCOLOR STAIN NATURAL UV GOLD Possui intervalo entre demãos de 12 horas, resistente contra chuva e sol. Rendimento por demão: 10 a 15m² para o quartinho de 0,9L, e 36 a 54m² para o galão de 3,6L. Disponível nas quantidades de 3,6 L e 0,9 L."
    },
    {
        "page": 75,
        "chunk_id": 82,
        "text": "OSMOCOLOR STAIN IPÊ (SEMITRANSPARENTE) Intervalo entre demãos: 12h. Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão. QUANT. 3,6 L, 0,9 L. OSMOCOLOR STAIN MOGNO (SEMITRANSPARENTE) Intervalo entre demãos: 12h. Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão. QUANT. 3,6 L, 0,9 L. OSMOCOLOR STAIN INCOLOR UV GLASS Intervalo entre demãos: 12h. Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão. QUANT. 3,6 L, 0,9 L."
    },
    {
        "page": 75,
        "chunk_id": 83,
        "text": "OSMOCOLOR STAIN IPÊ (SEMITRANSPARENTE) Intervalo entre demãos: 12h Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão, tonalidade: 3,6 L para o galão e 0,9 L para o quartinho. OSMOCOLOR STAIN MOGNO (SEMITRANSPARENTE) Intervalo entre demãos: 12h Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão, tonalidade: 3,6 L para o galão e 0,9 L para o quartinho. OSMOCOLOR STAIN INCOLOR UV GLASS Intervalo entre demãos: 12h Quartinho (0,9L): 10 a 15m² por demão. Galão (3,6L): 36 a 54m² por demão, tonalidade: 3,6 L para o galão e 0,9 L para o quartinho."
    },
    {
        "page": 76,
        "chunk_id": 84,
        "text": "MASSA PARA MADEIRA disponível em diversas tonalidades: CEREJEIRA, IMBUIA, IPÊ, MARFIM, MOGNO. Quantidade disponível: 1,5 kg, exceto para IMBUIA que também possui embalagem de 220g. Tempo de secagem: Camadas finas - até 3 horas; Camadas grossas - após 24 horas. Rendimento aproximado: Bisnaga (220g) - 0,44 a 0,88m²; Pote pequeno (400g) - 0,80 a 1,60m²; Pote grande (1,6kg) - 3,2 a 6,4m²."
    },
    {
        "page": 77,
        "chunk_id": 85,
        "text": "FIQUE POR DENTRO DAS NOVIDADES Madeireira Woodfort (62)3282-7788 adriano@woodfort.com.br LÍDER DE VENDAS NO ESTADO DE GOIÁS. Para eventuais dúvidas, entre em contato conosco."
    }
]